# Ваше завдання — написати функцію add_one,
# яка приймає список із цифр, які у свою чергу є одним числом.
# До нього необхідно додати 1.
# Тобто. Вам необхідно з набору цифр,
# що входять до списку, отримати число,
# скласти його з 1 і отриману суму, знову розбити на список із цифр.
# В результаті функція повертає список із цифр, що становлять значення суми.

def add_one(some_list) -> list:
    tmp = ''.join(map(str, some_list))
    tmp = int(tmp) + 1
    return list(map(int, str(tmp)))

# Test
assert add_one([1, 2, 3, 4]) == [1, 2, 3, 5], 'Test1'
assert add_one([9, 9, 9]) == [1, 0, 0, 0], 'Test2'
assert add_one([0]) == [1], 'Test3'
assert add_one([9]) == [1, 0], 'Test4'
print("ОК")
