# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
# Тобто, в результаті повинен вийти список із 2-х списків.

# list1 = [1, 2, 3, 4, 5, 6] # => [[1, 2, 3], [4, 5, 6]]
# list1 = [1, 2, 3] # => [[1, 2], [3]]
# list1 = [1, 2, 3, 4, 5]  # => [[1, 2, 3], [4, 5]]
# list1 = [1] #=> [[1], []]
list1 = [] #=> [[], []]

print(list1)
x = len(list1)
y = x // 2
#r = int(y) + bool(y % 1)
if x % 2 != 0: # тобто не ціле цисло
    y += 1
list2 = list1[:y]
list3 = list1[y:]
list4 = [list2, list3]
print(list4)

