# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!

lst = [0, 1, 0, 12, 3] #-> [1, 12, 3, 0, 0]
#lst = [0] #-> [0]
#lst = [1, 0, 13, 0, 0, 0, 5] #-> [1, 13, 5, 0, 0, 0, 0]
#lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] #-> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]


lst1 = []
lst2 = []
for i in lst:
    if i != 0:
        lst1.append(i)
    else:
        lst2.append(i)
print(lst1 + lst2)



