# Для списку цілих чисел потрібно знайти суму елементів
# із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити
# цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.

#list =  [0, 1, 7, 2, 4, 8] # => (0 + 7 + 4) * 8 = 88
#list = [1, 3, 5] #=> 30
#list = [6]  #=> 36
list = [] #=> 0

x = len(list)
if x == 0:
    print(list)
    print(0)
else:
    list2 = list [::2]
    print(list [::2])
    y = sum(list2)
    print(sum(list2))
    z = y * list[-1]
    print(z)

